OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
#define SYS_IRCTRIMCTL_CLKERR_STOP  ((uint32_t)0x00000100)      /*!<Clock error stop enable */

/********************* Bit definition of IRCTRIMIEN register **********************/
#define SYS_IRCTRIMIEN_DISABLE      ((uint32_t)0x00000000)      /*!<Trim failure interrupt disable */
#define SYS_IRCTRIMIEN_FAIL_EN      ((uint32_t)0x00000002)      /*!<Trim failure interrupt enable */
#define SYS_IRCTRIMIEN_32KERR_EN    ((uint32_t)0x00000004)      /*!<32.768 kHz Clock Error Interrupt Enable */

/********************* Bit definition of IRCTRIMINT register **********************/
#define SYS_IRCTRIMINT_FREQLOCK     ((uint32_t)0x00000001)      /*!<HIRC frequency lock status */
#define SYS_IRCTRIMINT_FAIL_INT     ((uint32_t)0x00000002)      /*!<Trim failure interrupt status */
#define SYS_IRCTRIMINT_32KERR_INT   ((uint32_t)0x00000004)      /*!<32.768 kHz Clock Error Interrupt Status */

/********************* Bit definition of PA_L_MFP register **********************/
#define SYS_PA_L_MFP_PA7_MFP_GPA7         (0UL<<SYS_PA_L_MFP_PA7_MFP_Pos)     /*!<PA7 Pin Function - GPIOA[7] */
#define SYS_PA_L_MFP_PA7_MFP_ADC_CH7      (2UL<<SYS_PA_L_MFP_PA7_MFP_Pos)     /*!<PA7 Pin Function - ADC input channel 7 */
#define SYS_PA_L_MFP_PA7_MFP_SC1_CD       (4UL<<SYS_PA_L_MFP_PA7_MFP_Pos)     /*!<PA7 Pin Function - SmartCard 1 detect pin */


#define SYS_PA_L_MFP_PA6_MFP_GPA6         (0UL<<SYS_PA_L_MFP_PA6_MFP_Pos)     /*!<PA6 Pin Function - GPIOA[6] */
#define SYS_PA_L_MFP_PA6_MFP_ADC_CH6      (2UL<<SYS_PA_L_MFP_PA6_MFP_Pos)     /*!<PA6 Pin Function - ADC input channel 6 */
#define SYS_PA_L_MFP_PA6_MFP_ACMP0_O      (3UL<<SYS_PA_L_MFP_PA6_MFP_Pos)     /*!<PA6 Pin Function - Comparator0 output */
#define SYS_PA_L_MFP_PA6_MFP_SC0_RST      (4UL<<SYS_PA_L_MFP_PA6_MFP_Pos)     /*!<PA6 Pin Function - SmartCard0 RST pin */
#define SYS_PA_L_MFP_PA6_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA6_MFP_Pos)     /*!<PA6 Pin Function - Comparator0 charge/discharge path */


#define SYS_PA_L_MFP_PA5_MFP_GPA5         (0UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - GPIOA[5] */
#define SYS_PA_L_MFP_PA5_MFP_ADC_CH5      (2UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - ADC input channel 5 */
#define SYS_PA_L_MFP_PA5_MFP_ACMP0_N      (3UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - Comparator0 N-end input0 */
#define SYS_PA_L_MFP_PA5_MFP_SC0_PWR      (4UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - SmartCard0 Power pin */
#define SYS_PA_L_MFP_PA5_MFP_I2C1_SDA     (5UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - I2C1 data I/O pin */
#define SYS_PA_L_MFP_PA5_MFP_SPI1_SS0     (6UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - SPI1 1st chip selection */
#define SYS_PA_L_MFP_PA5_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA5_MFP_Pos)     /*!<PA5 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_L_MFP_PA4_MFP_GPA4         (0UL<<SYS_PA_L_MFP_PA4_MFP_Pos)     /*!<PA4 Pin Function - GPIOA[4] */
#define SYS_PA_L_MFP_PA4_MFP_ADC_CH4      (2UL<<SYS_PA_L_MFP_PA4_MFP_Pos)     /*!<PA4 Pin Function - ADC input channel 4 */
#define SYS_PA_L_MFP_PA4_MFP_ACMP0_P      (3UL<<SYS_PA_L_MFP_PA4_MFP_Pos)     /*!<PA4 Pin Function - Comparator0 P-end input0 */
#define SYS_PA_L_MFP_PA4_MFP_SC0_CD       (4UL<<SYS_PA_L_MFP_PA4_MFP_Pos)     /*!<PA4 Pin Function - SmartCard0 card detect pin */
#define SYS_PA_L_MFP_PA4_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA4_MFP_Pos)     /*!<PA4 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_L_MFP_PA3_MFP_GPA3         (0UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - GPIOA[3] */
#define SYS_PA_L_MFP_PA3_MFP_EINT1        (1UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - External interrupt 1 */
#define SYS_PA_L_MFP_PA3_MFP_ADC_CH3      (2UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - ADC input channel 3 */
#define SYS_PA_L_MFP_PA3_MFP_ACMP0_P      (3UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - Comparator0 P-end input1 */
#define SYS_PA_L_MFP_PA3_MFP_SC0_DAT      (4UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - SmartCard0 DATA */
#define SYS_PA_L_MFP_PA3_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA3_MFP_Pos)     /*!<PA3 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_L_MFP_PA2_MFP_GPA2         (0UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - GPIOA[2] */
#define SYS_PA_L_MFP_PA2_MFP_EINT0        (1UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - External interrupt 0 */
#define SYS_PA_L_MFP_PA2_MFP_ADC_CH2      (2UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - ADC input channel 2 */
#define SYS_PA_L_MFP_PA2_MFP_ACMP0_P      (3UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - Comparator0 P-end input3 */
#define SYS_PA_L_MFP_PA2_MFP_SC0_CLK      (4UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - SmartCard0 clock */
#define SYS_PA_L_MFP_PA2_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA2_MFP_Pos)     /*!<PA2 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_L_MFP_PA1_MFP_GPA1         (0UL<<SYS_PA_L_MFP_PA1_MFP_Pos)     /*!<PA1 Pin Function - GPIOA[1] */
#define SYS_PA_L_MFP_PA1_MFP_ADC_CH1      (2UL<<SYS_PA_L_MFP_PA1_MFP_Pos)     /*!<PA1 Pin Function - ADC input channel 1 */
#define SYS_PA_L_MFP_PA1_MFP_ACMP0_P      (3UL<<SYS_PA_L_MFP_PA1_MFP_Pos)     /*!<PA1 Pin Function - Comparator0 P-end input3 */
#define SYS_PA_L_MFP_PA1_MFP_ACMP0_C      (9UL<<SYS_PA_L_MFP_PA1_MFP_Pos)     /*!<PA1 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_L_MFP_PA0_MFP_GPA0         (0UL<<SYS_PA_L_MFP_PA0_MFP_Pos)     /*!<PA0 Pin Function - GPIOA[0] */
#define SYS_PA_L_MFP_PA0_MFP_ADC_CH0      (2UL<<SYS_PA_L_MFP_PA0_MFP_Pos)     /*!<PA0 Pin Function - ADC input channel 0 */

/********************* Bit definition of PA_H_MFP register **********************/
#define SYS_PA_H_MFP_PA15_MFP_GPA15       (0UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - GPIOA[15] */
#define SYS_PA_H_MFP_PA15_MFP_TMR3_CAP    (2UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - Timer1 capture event */
#define SYS_PA_H_MFP_PA15_MFP_ACMP1_O     (3UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - Comparator1 output */
#define SYS_PA_H_MFP_PA15_MFP_I2C1_SDA    (5UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - I2C1 data I/O pin */
#define SYS_PA_H_MFP_PA15_MFP_SPI1_SS0    (6UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - SPI1 1st chip selection */
#define SYS_PA_H_MFP_PA15_MFP_LCD_S16     (8UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - LCD SEG 16 */
#define SYS_PA_H_MFP_PA15_MFP_LCD_S30     (8UL<<SYS_PA_H_MFP_PA15_MFP_Pos)    /*!<PA15 Pin Function - LCD SEG 30 */

