OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
#define SYS_PA_H_MFP_PA14_MFP_GPA14       (0UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - GPIOA[14] */
#define SYS_PA_H_MFP_PA14_MFP_I2C1_SCL    (5UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - I2C1 clock pin */
#define SYS_PA_H_MFP_PA14_MFP_SPI1_SCLK   (6UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - SPI1 clock pin */
#define SYS_PA_H_MFP_PA14_MFP_LCD_S17     (8UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - LCD SEG 17 */
#define SYS_PA_H_MFP_PA14_MFP_LCD_S31     (8UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - LCD SEG 31 */
#define SYS_PA_H_MFP_PA14_MFP_ACMP0_C     (9UL<<SYS_PA_H_MFP_PA14_MFP_Pos)    /*!<PA14 Pin Function - Comparator0 charge/discharge path */

#define SYS_PA_H_MFP_PA13_MFP_GPA13       (0UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - GPIOA[13] */
#define SYS_PA_H_MFP_PA13_MFP_ACMP1_N     (3UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - Comparator1 N-end input */
#define SYS_PA_H_MFP_PA13_MFP_I2C0_SDA    (5UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - I2C0 data I/O pin*/
#define SYS_PA_H_MFP_PA13_MFP_SPI1_MISO0  (6UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - SPI1 MISO[0] */
#define SYS_PA_H_MFP_PA13_MFP_UART0_RX    (7UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - UART1 RX */
#define SYS_PA_H_MFP_PA13_MFP_LCD_S18     (8UL<<SYS_PA_H_MFP_PA13_MFP_Pos)    /*!<PA13 Pin Function - LCD SEG 18 */

#define SYS_PA_H_MFP_PA12_MFP_GPA12       (0UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - GPIOA[12] */
#define SYS_PA_H_MFP_PA12_MFP_ACMP1_P     (3UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - Comparator1 N-end input */
#define SYS_PA_H_MFP_PA12_MFP_I2C0_SCL    (5UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - I2C0 clock pin */
#define SYS_PA_H_MFP_PA12_MFP_SPI1_MOSI0  (6UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - SPI1 MOSI[0] */
#define SYS_PA_H_MFP_PA12_MFP_UART0_TX    (7UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - UART1 TX */
#define SYS_PA_H_MFP_PA12_MFP_LCD_S19     (8UL<<SYS_PA_H_MFP_PA12_MFP_Pos)    /*!<PA12 Pin Function - LCD SEG 19 */

#define SYS_PA_H_MFP_PA11_MFP_GPA11       (0UL<<SYS_PA_H_MFP_PA11_MFP_Pos)    /*!<PA11 Pin Function - GPIOA[11] */
#define SYS_PA_H_MFP_PA11_MFP_ADC_EXT     (2UL<<SYS_PA_H_MFP_PA11_MFP_Pos)    /*!<PA11 Pin Function - ADC external trigger */
#define SYS_PA_H_MFP_PA11_MFP_SC0_DAT     (4UL<<SYS_PA_H_MFP_PA11_MFP_Pos)    /*!<PA11 Pin Function - SmartCard0 DATA */

#define SYS_PA_H_MFP_PA10_MFP_GPA10       (0UL<<SYS_PA_H_MFP_PA10_MFP_Pos)    /*!<PA10 Pin Function - GPIOA[10] */
#define SYS_PA_H_MFP_PA10_MFP_SC0_CLK     (4UL<<SYS_PA_H_MFP_PA10_MFP_Pos)    /*!<PA10 Pin Function - SmartCard0 clock */

#define SYS_PA_H_MFP_PA9_MFP_GPA9         (0UL<<SYS_PA_H_MFP_PA9_MFP_Pos)     /*!<PA9 Pin Function - GPIOA[9] */
#define SYS_PA_H_MFP_PA9_MFP_SC0_RST      (4UL<<SYS_PA_H_MFP_PA9_MFP_Pos)     /*!<PA9 Pin Function - SmartCard0 RST */

#define SYS_PA_H_MFP_PA8_MFP_GPA8         (0UL<<SYS_PA_H_MFP_PA8_MFP_Pos)     /*!<PA8 Pin Function - GPIOA[8] */
#define SYS_PA_H_MFP_PA8_MFP_SC0_PWR      (4UL<<SYS_PA_H_MFP_PA8_MFP_Pos)     /*!<PA8 Pin Function - SmartCard0 power */

/********************* Bit definition of PB_L_MFP register **********************/
#define SYS_PB_L_MFP_PB7_MFP_GPB7         (0UL<<SYS_PB_L_MFP_PB7_MFP_Pos)     /*!<PB7 Pin Function - GPIOB[7] */
#define SYS_PB_L_MFP_PB7_MFP_SC0_CD       (4UL<<SYS_PB_L_MFP_PB7_MFP_Pos)     /*!<PB7 Pin Function - SmartCard0 card detect */
#define SYS_PB_L_MFP_PB7_MFP_UART1_CTS    (7UL<<SYS_PB_L_MFP_PB7_MFP_Pos)     /*!<PB7 Pin Function - UART1 CTSn */
#define SYS_PB_L_MFP_PB7_MFP_LCD_S33      (8UL<<SYS_PB_L_MFP_PB7_MFP_Pos)     /*!<PB7 Pin Function - LCD SEG 33 */

#define SYS_PB_L_MFP_PB6_MFP_GPB6         (0UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - GPIOB[6] */
#define SYS_PB_L_MFP_PB6_MFP_CKO0         (1UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - Frequency Divider0 output pin */
#define SYS_PB_L_MFP_PB6_MFP_SPI1_SS1     (6UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - SPI2 2nd slave select pin */
#define SYS_PB_L_MFP_PB6_MFP_UART1_TX     (7UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - UART1 TX */
#define SYS_PB_L_MFP_PB6_MFP_LCD_S25      (8UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - LCD SEG 25 */
#define SYS_PB_L_MFP_PB6_MFP_LCD_S34      (8UL<<SYS_PB_L_MFP_PB6_MFP_Pos)     /*!<PB6 Pin Function - LCD SEG 34 */

#define SYS_PB_L_MFP_PB5_MFP_GPB5         (0UL<<SYS_PB_L_MFP_PB5_MFP_Pos)     /*!<PB5 Pin Function - GPIOB[5] */
#define SYS_PB_L_MFP_PB5_MFP_SPI1_MOSI1   (6UL<<SYS_PB_L_MFP_PB5_MFP_Pos)     /*!<PB5 Pin Function - SPI1 MOSI[1] */
#define SYS_PB_L_MFP_PB5_MFP_UART1_RX     (7UL<<SYS_PB_L_MFP_PB5_MFP_Pos)     /*!<PB5 Pin Function - UART1 RX */
#define SYS_PB_L_MFP_PB5_MFP_LCD_S35      (8UL<<SYS_PB_L_MFP_PB5_MFP_Pos)     /*!<PB5 Pin Function - LCD SEG 35 */

#define SYS_PB_L_MFP_PB4_MFP_GPB4         (0UL<<SYS_PB_L_MFP_PB4_MFP_Pos)     /*!<PB4 Pin Function - GPIOB[4] */
#define SYS_PB_L_MFP_PB4_MFP_SPI1_MISO1   (6UL<<SYS_PB_L_MFP_PB4_MFP_Pos)     /*!<PB4 Pin Function - SPI2 MISO[1] */
#define SYS_PB_L_MFP_PB4_MFP_UART1_RTS    (7UL<<SYS_PB_L_MFP_PB4_MFP_Pos)     /*!<PB4 Pin Function - UART1 RTS */

#define SYS_PB_L_MFP_PB3_MFP_GPB3         (0UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - GPIOB[3] */
#define SYS_PB_L_MFP_PB3_MFP_TMR2_CNT     (2UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - Timer2 external counter input  */
#define SYS_PB_L_MFP_PB3_MFP_I2C0_SDA     (5UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - I2C0 data I/O pin */
#define SYS_PB_L_MFP_PB3_MFP_SPI1_MISO1   (6UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - SPI1 MISO[1] */
#define SYS_PB_L_MFP_PB3_MFP_UART0_CTS    (7UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - UART0 CTSn */
#define SYS_PB_L_MFP_PB3_MFP_LCD_S26      (8UL<<SYS_PB_L_MFP_PB3_MFP_Pos)     /*!<PB3 Pin Function - LCD SEG 26 */
#define SYS_PB_L_MFP_PB3_MFP_TMR2_OUT     (0xAUL<<SYS_PB_L_MFP_PB3_MFP_Pos)   /*!<PB3 Pin Function - Timer2 toggle out */

#define SYS_PB_L_MFP_PB2_MFP_GPB2         (0UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - GPIOB[2] */
#define SYS_PB_L_MFP_PB2_MFP_TMR3_CNT     (2UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - Timer3 external counter input  */
#define SYS_PB_L_MFP_PB2_MFP_I2C0_SCL     (5UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - I2C0 clock pin */
#define SYS_PB_L_MFP_PB2_MFP_SPI1_MOSI1   (6UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - SPI1 MOSI[1] */
#define SYS_PB_L_MFP_PB2_MFP_UART0_RTS    (7UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - UART0 RTSn */
#define SYS_PB_L_MFP_PB2_MFP_LCD_S27      (8UL<<SYS_PB_L_MFP_PB2_MFP_Pos)     /*!<PB2 Pin Function - LCD SEG 27 */
#define SYS_PB_L_MFP_PB2_MFP_TMR3_OUT     (0xAUL<<SYS_PB_L_MFP_PB2_MFP_Pos)   /*!<PB2 Pin Function - Timer3 toggle out */

#define SYS_PB_L_MFP_PB1_MFP_GPB1         (0UL<<SYS_PB_L_MFP_PB1_MFP_Pos)     /*!<PB1 Pin Function - GPIOB[1] */
#define SYS_PB_L_MFP_PB1_MFP_EINT1        (1UL<<SYS_PB_L_MFP_PB1_MFP_Pos)     /*!<PB1 Pin Function - External interrupt1 input pin */
#define SYS_PB_L_MFP_PB1_MFP_TMR2_CAP     (2UL<<SYS_PB_L_MFP_PB1_MFP_Pos)     /*!<PB1 Pin Function - Timer2 capture event */
#define SYS_PB_L_MFP_PB1_MFP_UART0_RX     (7UL<<SYS_PB_L_MFP_PB1_MFP_Pos)     /*!<PB1 Pin Function - UART0 RX */
#define SYS_PB_L_MFP_PB1_MFP_LCD_S28      (8UL<<SYS_PB_L_MFP_PB1_MFP_Pos)     /*!<PB1 Pin Function - LCD SEG 28 */

#define SYS_PB_L_MFP_PB0_MFP_GPB0         (0UL<<SYS_PB_L_MFP_PB0_MFP_Pos)     /*!<PB0 Pin Function - GPIOB[0] */
#define SYS_PB_L_MFP_PB0_MFP_CKO1         (1UL<<SYS_PB_L_MFP_PB0_MFP_Pos)     /*!<PB0 Pin Function - Frequency Divider1 output pin */
#define SYS_PB_L_MFP_PB0_MFP_UART0_TX     (7UL<<SYS_PB_L_MFP_PB0_MFP_Pos)     /*!<PB0 Pin Function - UART0 TX */
#define SYS_PB_L_MFP_PB0_MFP_LCD_S29      (8UL<<SYS_PB_L_MFP_PB0_MFP_Pos)     /*!<PB0 Pin Function - LCD SEG 29 */

/********************* Bit definition of PB_H_MFP register **********************/
#define SYS_PB_H_MFP_PB15_MFP_GPB15       (0UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - GPIOB[15] */
#define SYS_PB_H_MFP_PB15_MFP_SPI0_SS0    (6UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - SPI0 1st slave select pin */
#define SYS_PB_H_MFP_PB15_MFP_UART0_CTS   (7UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - UART0 CTSn */
#define SYS_PB_H_MFP_PB15_MFP_LCD_S12     (8UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - LCD SEG 12 */
#define SYS_PB_H_MFP_PB15_MFP_LCD_S19     (8UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - LCD SEG 19 */
#define SYS_PB_H_MFP_PB15_MFP_LCD_S23     (8UL<<SYS_PB_H_MFP_PB15_MFP_Pos)    /*!<PB15 Pin Function - LCD SEG 23 */

#define SYS_PB_H_MFP_PB14_MFP_GPB14       (0UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB14 Pin Function - GPIOB[14] */
#define SYS_PB_H_MFP_PB14_MFP_SPI0_SCLK   (6UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB15 Pin Function - SPI0 serial clock pin */
#define SYS_PB_H_MFP_PB14_MFP_UART0_TX    (7UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB15 Pin Function - UART0 TX */
#define SYS_PB_H_MFP_PB14_MFP_LCD_S13     (8UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB14 Pin Function - LCD SEG 13 */
#define SYS_PB_H_MFP_PB14_MFP_LCD_S20     (8UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB14 Pin Function - LCD SEG 20 */
#define SYS_PB_H_MFP_PB14_MFP_LCD_S24     (8UL<<SYS_PB_H_MFP_PB14_MFP_Pos)    /*!<PB14 Pin Function - LCD SEG 24 */

#define SYS_PB_H_MFP_PB13_MFP_GPB13       (0UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - GPIOB[13] */
#define SYS_PB_H_MFP_PB13_MFP_SPI0_MISO0  (6UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - SPI0 MISO[0] */
#define SYS_PB_H_MFP_PB13_MFP_UART0_RX    (7UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - UART0 RX */
#define SYS_PB_H_MFP_PB13_MFP_LCD_S14     (8UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - LCD SEG 14 */
#define SYS_PB_H_MFP_PB13_MFP_LCD_S21     (8UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - LCD SEG 21 */
#define SYS_PB_H_MFP_PB13_MFP_LCD_S25     (8UL<<SYS_PB_H_MFP_PB13_MFP_Pos)    /*!<PB13 Pin Function - LCD SEG 25 */

#define SYS_PB_H_MFP_PB12_MFP_GPB12       (0UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - GPIOB[12] */
#define SYS_PB_H_MFP_PB12_MFP_CKO0        (1UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - Frequency Divider0 output pin */
#define SYS_PB_H_MFP_PB12_MFP_TMR0_CNT    (2UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - Timer0 external counter input */
#define SYS_PB_H_MFP_PB12_MFP_SPI0_MOSI0  (6UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - SPI0 MOSI[0] */
#define SYS_PB_H_MFP_PB12_MFP_UART0_RTS   (7UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - UART0 RTSn */
#define SYS_PB_H_MFP_PB12_MFP_LCD_S15     (8UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - LCD SEG 15 */
#define SYS_PB_H_MFP_PB12_MFP_LCD_S22     (8UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - LCD SEG 22 */
#define SYS_PB_H_MFP_PB12_MFP_LCD_S26     (8UL<<SYS_PB_H_MFP_PB12_MFP_Pos)    /*!<PB12 Pin Function - LCD SEG 26 */
#define SYS_PB_H_MFP_PB12_MFP_TMR0_OUT    (0xAUL<<SYS_PB_H_MFP_PB12_MFP_Pos)  /*!<PB12 Pin Function - Timer0 toggle out */

#define SYS_PB_H_MFP_PB11_MFP_GPB11       (0UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - GPIOB[11] */
#define SYS_PB_H_MFP_PB11_MFP_TMR1_CNT    (2UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - Timer1 external event input */
#define SYS_PB_H_MFP_PB11_MFP_SPI0_MISO1  (6UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - SPI0 MISO[1] */
#define SYS_PB_H_MFP_PB11_MFP_UART1_RTS   (7UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - UART1 RTSn */
#define SYS_PB_H_MFP_PB11_MFP_LCD_S23     (8UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - LCD SEG 23 */
#define SYS_PB_H_MFP_PB11_MFP_LCD_S27     (8UL<<SYS_PB_H_MFP_PB11_MFP_Pos)   /*!<PB11 Pin Function - LCD SEG 27 */
#define SYS_PB_H_MFP_PB11_MFP_TMR1_OUT    (0xAUL<<SYS_PB_H_MFP_PB11_MFP_Pos) /*!<PB11 Pin Function - Timer1 toggle out */

