OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
#define SYS_PB_H_MFP_PB10_MFP_GPB10       (0UL<<SYS_PB_H_MFP_PB10_MFP_Pos)  /*!<PB10 Pin Function - GPIOB[10] */
#define SYS_PB_H_MFP_PB10_MFP_SPI0_MOSI1  (6UL<<SYS_PB_H_MFP_PB10_MFP_Pos)  /*!<PB10 Pin Function - SPI0 MOSI[1] */
#define SYS_PB_H_MFP_PB10_MFP_UART1_RX    (7UL<<SYS_PB_H_MFP_PB10_MFP_Pos)  /*!<PB10 Pin Function - UART1 RX */
#define SYS_PB_H_MFP_PB10_MFP_LCD_S24     (8UL<<SYS_PB_H_MFP_PB10_MFP_Pos)  /*!<PB10 Pin Function - LCD SEG 24 */
#define SYS_PB_H_MFP_PB10_MFP_LCD_S28     (8UL<<SYS_PB_H_MFP_PB10_MFP_Pos)  /*!<PB10 Pin Function - LCD SEG 28 */

#define SYS_PB_H_MFP_PB9_MFP_GPB9         (0UL<<SYS_PB_H_MFP_PB9_MFP_Pos) /*!<PB9 Pin Function - GPIOB[9] */
#define SYS_PB_H_MFP_PB9_MFP_PWM0_CH1     (3UL<<SYS_PB_H_MFP_PB9_MFP_Pos) /*!<PB9 Pin Function - PWM0 Channel1 output */
#define SYS_PB_H_MFP_PB9_MFP_LCD_S31      (8UL<<SYS_PB_H_MFP_PB9_MFP_Pos) /*!<PB9 Pin Function - LCD SEG 31 */

#define SYS_PB_H_MFP_PB8_MFP_GPB8         (0UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - GPIOB[8] */
#define SYS_PB_H_MFP_PB8_MFP_EINT1        (1UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - External interrupt1 input pin */
#define SYS_PB_H_MFP_PB8_MFP_TMR0_CNT     (2UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - Timer0 external counter input */
#define SYS_PB_H_MFP_PB8_MFP_PWM0_CH0     (3UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - PWM0 Channel0 output */
#define SYS_PB_H_MFP_PB8_MFP_SNOOPER      (4UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - Snooper pin */
#define SYS_PB_H_MFP_PB8_MFP_LCD_S32      (8UL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - LCD SEG 32 */
#define SYS_PB_H_MFP_PB8_MFP_TMR0_OUT     (0xAUL<<SYS_PB_H_MFP_PB8_MFP_Pos) /*!<PB8 Pin Function - Timer0 toggle out */

/********************* Bit definition of PC_L_MFP register **********************/
#define SYS_PC_L_MFP_PC7_MFP_GPC7         (0UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - GPIOC[7] */
#define SYS_PC_L_MFP_PC7_MFP_SC0_PWR      (4UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - SmartCard0 Power pin */
#define SYS_PC_L_MFP_PC7_MFP_UART1_RX     (7UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - UART1 RX */
#define SYS_PC_L_MFP_PC7_MFP_LCD_S4       (8UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - LCD SEG 4 */
#define SYS_PC_L_MFP_PC7_MFP_LCD_S11      (8UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - LCD SEG 11 */
#define SYS_PC_L_MFP_PC7_MFP_LCD_S15      (8UL<<SYS_PC_L_MFP_PC7_MFP_Pos)     /*!<PC7 Pin Function - LCD SEG 15 */

#define SYS_PC_L_MFP_PC6_MFP_GPC6         (0UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - GPIOC[6] */
#define SYS_PC_L_MFP_PC6_MFP_SC0_DAT      (4UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - SmartCard0 data */
#define SYS_PC_L_MFP_PC6_MFP_UART1_RTS    (7UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - UART1 RTSn */
#define SYS_PC_L_MFP_PC6_MFP_LCD_S5       (8UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - LCD SEG 5 */
#define SYS_PC_L_MFP_PC6_MFP_LCD_S12      (8UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - LCD SEG 12 */
#define SYS_PC_L_MFP_PC6_MFP_LCD_S16      (8UL<<SYS_PC_L_MFP_PC6_MFP_Pos)     /*!<PC6 Pin Function - LCD SEG 16 */

#define SYS_PC_L_MFP_PC5_MFP_GPC5         (0UL<<SYS_PC_L_MFP_PC5_MFP_Pos)     /*!<PC5 Pin Function - GPIOC[5] */
#define SYS_PC_L_MFP_PC5_MFP_SC0_CD       (4UL<<SYS_PC_L_MFP_PC5_MFP_Pos)     /*!<PC5 Pin Function - SmartCard0 card detect pin */
#define SYS_PC_L_MFP_PC5_MFP_LCD_S6       (8UL<<SYS_PC_L_MFP_PC5_MFP_Pos)     /*!<PC5 Pin Function - LCD SEG 6 */
#define SYS_PC_L_MFP_PC5_MFP_LCD_S13      (8UL<<SYS_PC_L_MFP_PC5_MFP_Pos)     /*!<PC5 Pin Function - LCD SEG 13 */
#define SYS_PC_L_MFP_PC5_MFP_LCD_S17      (8UL<<SYS_PC_L_MFP_PC5_MFP_Pos)     /*!<PC5 Pin Function - LCD SEG 17 */

#define SYS_PC_L_MFP_PC4_MFP_GPC4         (0UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - GPIOC[4] */
#define SYS_PC_L_MFP_PC4_MFP_EINT0        (1UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - External interrupt0 input pin */
#define SYS_PC_L_MFP_PC4_MFP_SC0_CLK      (4UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - SmartCard0 clock */
#define SYS_PC_L_MFP_PC4_MFP_UART1_CTS    (7UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - UART1 CTSn */
#define SYS_PC_L_MFP_PC4_MFP_LCD_S7       (8UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - LCD SEG 7 */
#define SYS_PC_L_MFP_PC4_MFP_LCD_S14      (8UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - LCD SEG 14 */
#define SYS_PC_L_MFP_PC4_MFP_LCD_S18      (8UL<<SYS_PC_L_MFP_PC4_MFP_Pos)     /*!<PC4 Pin Function - LCD SEG 18 */

#define SYS_PC_L_MFP_PC3_MFP_GPC3         (0UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - GPIOC[3] */
#define SYS_PC_L_MFP_PC3_MFP_PWM0_CH3     (3UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - PWM0 Channel3 output */
#define SYS_PC_L_MFP_PC3_MFP_I2C1_SDA     (5UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - I2C1 data I/O pin */
#define SYS_PC_L_MFP_PC3_MFP_LCD_S8       (8UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - LCD SEG 8 */
#define SYS_PC_L_MFP_PC3_MFP_LCD_S15      (8UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - LCD SEG 15 */
#define SYS_PC_L_MFP_PC3_MFP_LCD_S19      (8UL<<SYS_PC_L_MFP_PC3_MFP_Pos)     /*!<PC3 Pin Function - LCD SEG 19 */

#define SYS_PC_L_MFP_PC2_MFP_GPC2         (0UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - GPIOC[2] */
#define SYS_PC_L_MFP_PC2_MFP_PWM0_CH2     (3UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - PWM0 Channel2 output */
#define SYS_PC_L_MFP_PC2_MFP_I2C1_SCL     (5UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - I2C1 clock */
#define SYS_PC_L_MFP_PC2_MFP_LCD_S9       (8UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - LCD SEG 9 */
#define SYS_PC_L_MFP_PC2_MFP_LCD_S16      (8UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - LCD SEG 16 */
#define SYS_PC_L_MFP_PC2_MFP_LCD_S20      (8UL<<SYS_PC_L_MFP_PC2_MFP_Pos)     /*!<PC2 Pin Function - LCD SEG 20 */

