OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
#define SYS_PC_L_MFP_PC1_MFP_GPC1         (0UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - GPIOC[1] */
#define SYS_PC_L_MFP_PC1_MFP_PWM0_CH1     (3UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - PWM0 Channel1 output */
#define SYS_PC_L_MFP_PC1_MFP_I2C0_SDA     (5UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - I2C0 data I/O pin */
#define SYS_PC_L_MFP_PC1_MFP_LCD_S10      (8UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - LCD SEG 10 */
#define SYS_PC_L_MFP_PC1_MFP_LCD_S17      (8UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - LCD SEG 17 */
#define SYS_PC_L_MFP_PC1_MFP_LCD_S21      (8UL<<SYS_PC_L_MFP_PC1_MFP_Pos)     /*!<PC1 Pin Function - LCD SEG 21 */

#define SYS_PC_L_MFP_PC0_MFP_GPC0         (0UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - GPIOC[0] */
#define SYS_PC_L_MFP_PC0_MFP_PWM0_CH0     (3UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - PWM0 Channel0 output */
#define SYS_PC_L_MFP_PC0_MFP_I2C0_SCL     (5UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - I2C0 clock pin */
#define SYS_PC_L_MFP_PC0_MFP_SPI0_SS1     (6UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - SPI0 2nd slave select pin */
#define SYS_PC_L_MFP_PC0_MFP_LCD_S11      (8UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - LCD SEG 11 */
#define SYS_PC_L_MFP_PC0_MFP_LCD_S18      (8UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - LCD SEG 18 */
#define SYS_PC_L_MFP_PC0_MFP_LCD_S22      (8UL<<SYS_PC_L_MFP_PC0_MFP_Pos)     /*!<PC0 Pin Function - LCD SEG 22 */

/********************* Bit definition of PC_H_MFP register **********************/
#define SYS_PC_H_MFP_PC15_MFP_GPC15       (0UL<<SYS_PC_H_MFP_PC15_MFP_Pos)    /*!<PC15 Pin Function - GPIOC[15] */
#define SYS_PC_H_MFP_PC15_MFP_SC1_PWR     (4UL<<SYS_PC_H_MFP_PC15_MFP_Pos)    /*!<PC15 Pin Function - SmartCard1 PWR pin */
#define SYS_PC_H_MFP_PC15_MFP_LCD_S0      (8UL<<SYS_PC_H_MFP_PC15_MFP_Pos)    /*!<PC15 Pin Function - LCD SEG 0 */
#define SYS_PC_H_MFP_PC15_MFP_LCD_S7      (8UL<<SYS_PC_H_MFP_PC15_MFP_Pos)    /*!<PC15 Pin Function - LCD SEG 7 */

#define SYS_PC_H_MFP_PC14_MFP_GPC14       (0UL<<SYS_PC_H_MFP_PC14_MFP_Pos)    /*!<PC14 Pin Function - GPIOC[14] */
#define SYS_PC_H_MFP_PC14_MFP_SC1_CD      (4UL<<SYS_PC_H_MFP_PC14_MFP_Pos)    /*!<PC14 Pin Function - SmartCard1 card detect */
#define SYS_PC_H_MFP_PC14_MFP_LCD_S1      (7UL<<SYS_PC_H_MFP_PC14_MFP_Pos)    /*!<PC14 Pin Function - LCD SEG 1 */
#define SYS_PC_H_MFP_PC14_MFP_LCD_S8      (8UL<<SYS_PC_H_MFP_PC14_MFP_Pos)    /*!<PC14 Pin Function - LCD SEG 8 */

#define SYS_PC_H_MFP_PC13_MFP_GPC13       (0UL<<SYS_PC_H_MFP_PC13_MFP_Pos)    /*!<PC13 Pin Function - GPIOC[13] */
#define SYS_PC_H_MFP_PC13_MFP_SC1_DAT     (4UL<<SYS_PC_H_MFP_PC13_MFP_Pos)    /*!<PC13 Pin Function - SmartCard1 DATA */
#define SYS_PC_H_MFP_PC13_MFP_LCD_S9      (8UL<<SYS_PC_H_MFP_PC13_MFP_Pos)    /*!<PC13 Pin Function - LCD SEG 9 */

#define SYS_PC_H_MFP_PC12_MFP_GPC12       (0UL<<SYS_PC_H_MFP_PC12_MFP_Pos)    /*!<PC12 Pin Function - GPIOC[12] */
#define SYS_PC_H_MFP_PC12_MFP_SC1_CLK     (4UL<<SYS_PC_H_MFP_PC12_MFP_Pos)    /*!<PC12 Pin Function - SmartCard1 clock */
#define SYS_PC_H_MFP_PC12_MFP_LCD_S10     (8UL<<SYS_PC_H_MFP_PC12_MFP_Pos)    /*!<PC12 Pin Function - LCD SEG 10 */

#define SYS_PC_H_MFP_PC11_MFP_GPC11       (0UL<<SYS_PC_H_MFP_PC11_MFP_Pos)    /*!<PC11 Pin Function - GPIOC[11] */
#define SYS_PC_H_MFP_PC11_MFP_SC1_PWR     (4UL<<SYS_PC_H_MFP_PC11_MFP_Pos)    /*!<PC11 Pin Function - SmartCard1 PWR pin */
#define SYS_PC_H_MFP_PC11_MFP_I2C1_SDA    (5UL<<SYS_PC_H_MFP_PC11_MFP_Pos)    /*!<PC11 Pin Function - I2C1 data I/O pin */
#define SYS_PC_H_MFP_PC11_MFP_LCD_S11     (8UL<<SYS_PC_H_MFP_PC11_MFP_Pos)    /*!<PC11 Pin Function - LCD SEG 11 */

#define SYS_PC_H_MFP_PC10_MFP_GPC10       (0UL<<SYS_PC_H_MFP_PC10_MFP_Pos)    /*!<PC10 Pin Function - GPIOC[10] */
#define SYS_PC_H_MFP_PC10_MFP_SC1_CD      (4UL<<SYS_PC_H_MFP_PC10_MFP_Pos)    /*!<PC10 Pin Function - SmartCard1 card detect */
#define SYS_PC_H_MFP_PC10_MFP_I2C1_SCL    (5UL<<SYS_PC_H_MFP_PC10_MFP_Pos)    /*!<PC10 Pin Function - I2C1 clock pin */
#define SYS_PC_H_MFP_PC10_MFP_LCD_S12     (8UL<<SYS_PC_H_MFP_PC10_MFP_Pos)    /*!<PC10 Pin Function - LCD SEG 12 */

#define SYS_PC_H_MFP_PC9_MFP_GPC9         (0UL<<SYS_PC_H_MFP_PC9_MFP_Pos)     /*!<PC9 Pin Function - GPIOC[9] */
#define SYS_PC_H_MFP_PC9_MFP_LCD_S2       (8UL<<SYS_PC_H_MFP_PC9_MFP_Pos)     /*!<PC9 Pin Function - LCD SEG 2 */
#define SYS_PC_H_MFP_PC9_MFP_LCD_S9       (8UL<<SYS_PC_H_MFP_PC9_MFP_Pos)     /*!<PC9 Pin Function - LCD SEG 9 */
#define SYS_PC_H_MFP_PC9_MFP_LCD_S13      (8UL<<SYS_PC_H_MFP_PC9_MFP_Pos)     /*!<PC9 Pin Function - LCD SEG 13 */

#define SYS_PC_H_MFP_PC8_MFP_GPC8         (0UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - GPIOC[8] */
#define SYS_PC_H_MFP_PC8_MFP_SC0_RST      (4UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - SmartCard0 RST pin */
#define SYS_PC_H_MFP_PC8_MFP_UART1_TX     (7UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - UART1 Data transmitter output pin */
#define SYS_PC_H_MFP_PC8_MFP_LCD_S3       (8UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - LCD SEG 3 */
#define SYS_PC_H_MFP_PC8_MFP_LCD_S10      (8UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - LCD SEG 10 */
#define SYS_PC_H_MFP_PC8_MFP_LCD_S14      (8UL<<SYS_PC_H_MFP_PC8_MFP_Pos)     /*!<PC8 Pin Function - LCD SEG 14 */

/********************* Bit definition of PD_L_MFP register **********************/
#define SYS_PD_L_MFP_PD7_MFP_GPD7         (0UL<<SYS_PD_L_MFP_PD7_MFP_Pos)     /*!<PD7 Pin Function - GPIOD[7] */
#define SYS_PD_L_MFP_PD7_MFP_SC1_CLK      (4UL<<SYS_PD_L_MFP_PD7_MFP_Pos)     /*!<PD7 Pin Function - SmartCard1 clock */
#define SYS_PD_L_MFP_PD7_MFP_LCD_COM3     (8UL<<SYS_PD_L_MFP_PD7_MFP_Pos)     /*!<PD7 Pin Function - LCD COM 3 */

#define SYS_PD_L_MFP_PD6_MFP_GPD6         (0UL<<SYS_PD_L_MFP_PD6_MFP_Pos)     /*!<PD6 Pin Function - GPIOD[6] */
#define SYS_PD_L_MFP_PD6_MFP_LCD_S0       (8UL<<SYS_PD_L_MFP_PD6_MFP_Pos)     /*!<PD6 Pin Function - LCD SEG 0 */
#define SYS_PD_L_MFP_PD6_MFP_LCD_COM4     (8UL<<SYS_PD_L_MFP_PD6_MFP_Pos)     /*!<PD6 Pin Function - LCD COM 4 */

#define SYS_PD_L_MFP_PD5_MFP_GPD5         (0UL<<SYS_PD_L_MFP_PD5_MFP_Pos)     /*!<PD5 Pin Function - GPIOD[5] */
#define SYS_PD_L_MFP_PD5_MFP_LCD_S1       (8UL<<SYS_PD_L_MFP_PD5_MFP_Pos)     /*!<PD5 Pin Function - LCD SEG 1 */
#define SYS_PD_L_MFP_PD5_MFP_LCD_COM5     (8UL<<SYS_PD_L_MFP_PD5_MFP_Pos)     /*!<PD5 Pin Function - LCD COM 5 */

#define SYS_PD_L_MFP_PD4_MFP_GPD4         (0UL<<SYS_PD_L_MFP_PD4_MFP_Pos)     /*!<PD4 Pin Function - GPIOD[4] */
#define SYS_PD_L_MFP_PD4_MFP_SC1_RST      (4UL<<SYS_PD_L_MFP_PD4_MFP_Pos)     /*!<PD4 Pin Function - SmartCard1 RST pin */
#define SYS_PD_L_MFP_PD4_MFP_LCD_S2       (8UL<<SYS_PD_L_MFP_PD4_MFP_Pos)     /*!<PD4 Pin Function - LCD SEG 4 */

