OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
#define SYS_PD_L_MFP_PD3_MFP_GPD3         (0UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - GPIOD[3] */
#define SYS_PD_L_MFP_PD3_MFP_LCD_S3       (8UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - LCD SEG 3 */

#define SYS_PD_L_MFP_PD2_MFP_GPD2         (0UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - GPIOD[2] */
#define SYS_PD_L_MFP_PD2_MFP_LCD_S4       (8UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - LCD SEG 4 */

#define SYS_PD_L_MFP_PD1_MFP_GPD1         (0UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - GPIOD[1] */
#define SYS_PD_L_MFP_PD1_MFP_LCD_S5       (8UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - LCD SEG 5 */

#define SYS_PD_L_MFP_PD0_MFP_GPD0         (0UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - GPIOD[0] */
#define SYS_PD_L_MFP_PD0_MFP_LCD_S6       (8UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - LCD SEG 6 */

/********************* Bit definition of PD_H_MFP register **********************/
#define SYS_PD_H_MFP_PD15_MFP_GPD15       (0UL<<SYS_PD_H_MFP_PD15_MFP_Pos)    /*!<PD15 Pin Function - GPIOD[15] */
#define SYS_PD_H_MFP_PD15_MFP_LCD_V3      (8UL<<SYS_PD_H_MFP_PD15_MFP_Pos)    /*!<PD15 Pin Function - LCD V3 */

#define SYS_PD_H_MFP_PD14_MFP_GPD14       (0UL<<SYS_PD_H_MFP_PD14_MFP_Pos)    /*!<PD14 Pin Function - GPIOD[14] */
#define SYS_PD_H_MFP_PD14_MFP_LCD_V2      (8UL<<SYS_PD_H_MFP_PD14_MFP_Pos)    /*!<PD14 Pin Function - LCD V2 */

#define SYS_PD_H_MFP_PD13_MFP_GPD13       (0UL<<SYS_PD_H_MFP_PD13_MFP_Pos)    /*!<PD13 Pin Function - GPIOD[13] */
#define SYS_PD_H_MFP_PD13_MFP_EINT1       (1UL<<SYS_PD_H_MFP_PD13_MFP_Pos)    /*!<PD13 Pin Function - External interrupt 1 input pin */
#define SYS_PD_H_MFP_PD13_MFP_LCD_V1      (8UL<<SYS_PD_H_MFP_PD13_MFP_Pos)    /*!<PD13 Pin Function - LCD V1 */

#define SYS_PD_H_MFP_PD12_MFP_GPD12       (0UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - GPIOD[12] */
#define SYS_PD_H_MFP_PD12_MFP_CKO0        (1UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - Frequency Divider0 output pin */
#define SYS_PD_H_MFP_PD12_MFP_TMR1_CNT    (2UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - Timer1 external counter input */
#define SYS_PD_H_MFP_PD12_MFP_PWM0_CH0    (3UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - PWM0 Channel0 output */
#define SYS_PD_H_MFP_PD12_MFP_LCD_DH1     (8UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - LCD DH1 */
#define SYS_PD_H_MFP_PD12_MFP_CLK_Hz      (9UL<<SYS_PD_H_MFP_PD12_MFP_Pos)    /*!<PD12 Pin Function - RTC output pin */
#define SYS_PD_H_MFP_PD12_MFP_TMR1_OUT    (0xAUL<<SYS_PD_H_MFP_PD12_MFP_Pos)  /*!<PD12 Pin Function - Timer1 toggle out */

#define SYS_PD_H_MFP_PD11_MFP_GPD11       (0UL<<SYS_PD_H_MFP_PD11_MFP_Pos)    /*!<PD11 Pin Function - GPIOD[11] */
#define SYS_PD_H_MFP_PD11_MFP_TMR0_CAP    (2UL<<SYS_PD_H_MFP_PD11_MFP_Pos)    /*!<PD11 Pin Function - Timer0 capture input */
#define SYS_PD_H_MFP_PD11_MFP_PWM0_CH1    (3UL<<SYS_PD_H_MFP_PD11_MFP_Pos)    /*!<PD11 Pin Function - PWM0 Channel1 output */
#define SYS_PD_H_MFP_PD11_MFP_LCD_DH2     (8UL<<SYS_PD_H_MFP_PD11_MFP_Pos)    /*!<PD11 Pin Function - LCD DH2 */

#define SYS_PD_H_MFP_PD10_MFP_GPD10       (0UL<<SYS_PD_H_MFP_PD10_MFP_Pos)    /*!<PD10 Pin Function - GPIOD[10] */
#define SYS_PD_H_MFP_PD10_MFP_TMR1_CAP    (2UL<<SYS_PD_H_MFP_PD10_MFP_Pos)    /*!<PD10 Pin Function - Timer1 capture input  */
#define SYS_PD_H_MFP_PD10_MFP_PWM0_CH2    (3UL<<SYS_PD_H_MFP_PD10_MFP_Pos)    /*!<PD10 Pin Function - PWM0 Channel2 output */
#define SYS_PD_H_MFP_PD10_MFP_LCD_COM0    (8UL<<SYS_PD_H_MFP_PD10_MFP_Pos)    /*!<PD10 Pin Function - LCD COM0 */

#define SYS_PD_H_MFP_PD9_MFP_GPD9         (0UL<<SYS_PD_H_MFP_PD9_MFP_Pos)     /*!<PD9 Pin Function - GPIOD[9] */
#define SYS_PD_H_MFP_PD9_MFP_PWM0_CH3     (3UL<<SYS_PD_H_MFP_PD9_MFP_Pos)     /*!<PD9 Pin Function - PWM0 Channel3 output */
#define SYS_PD_H_MFP_PD9_MFP_SC1_RST      (4UL<<SYS_PD_H_MFP_PD9_MFP_Pos)     /*!<PD9 Pin Function - SmartCard1 RST pin */
#define SYS_PD_H_MFP_PD9_MFP_LCD_COM1     (8UL<<SYS_PD_H_MFP_PD9_MFP_Pos)     /*!<PD9 Pin Function - LCD COM1 */

#define SYS_PD_H_MFP_PD8_MFP_GPD8         (0UL<<SYS_PD_H_MFP_PD8_MFP_Pos)     /*!<PD8 Pin Function - GPIOD[8] */
#define SYS_PD_H_MFP_PD8_MFP_SC1_DAT      (4UL<<SYS_PD_H_MFP_PD8_MFP_Pos)     /*!<PD8 Pin Function - SmartCard1 data  */
#define SYS_PD_H_MFP_PD8_MFP_LCD_COM2     (8UL<<SYS_PD_H_MFP_PD8_MFP_Pos)     /*!<PD8 Pin Function - LCD COM2 */

/********************* Bit definition of PE_L_MFP register **********************/
#define SYS_PE_L_MFP_PE7_MFP_GPE7         (0UL<<SYS_PE_L_MFP_PE7_MFP_Pos)     /*!<PE7 Pin Function - GPIOE[7] */
#define SYS_PE_L_MFP_PE7_MFP_SC1_DAT      (4UL<<SYS_PE_L_MFP_PE7_MFP_Pos)     /*!<PE7 Pin Function - SmartCard1 data */

#define SYS_PE_L_MFP_PE6_MFP_GPE6         (0UL<<SYS_PE_L_MFP_PE6_MFP_Pos)     /*!<PE6 Pin Function - GPIOE[6] */
#define SYS_PE_L_MFP_PE6_MFP_SC1_CLK      (4UL<<SYS_PE_L_MFP_PE6_MFP_Pos)     /*!<PE6 Pin Function - SmartCard1 clock */

#define SYS_PE_L_MFP_PE5_MFP_GPE5         (0UL<<SYS_PE_L_MFP_PE5_MFP_Pos)     /*!<PE5 Pin Function - GPIOE[5] */
#define SYS_PE_L_MFP_PE5_MFP_SC1_PWR      (4UL<<SYS_PE_L_MFP_PE5_MFP_Pos)     /*!<PE5 Pin Function - SmartCard1 power */

#define SYS_PE_L_MFP_PE4_MFP_GPE4         (0UL<<SYS_PE_L_MFP_PE4_MFP_Pos)     /*!<PE4 Pin Function - GPIOE[4] */
#define SYS_PE_L_MFP_PE4_MFP_SC1_RST      (4UL<<SYS_PE_L_MFP_PE4_MFP_Pos)     /*!<PE4 Pin Function - SmartCard1 RST */

#define SYS_PE_L_MFP_PE3_MFP_GPE3         (0UL<<SYS_PE_L_MFP_PE3_MFP_Pos)     /*!<PE3 Pin Function - GPIOE[3] */
#define SYS_PE_L_MFP_PE3_MFP_SPI0_SS0     (6UL<<SYS_PE_L_MFP_PE3_MFP_Pos)     /*!<PE3 Pin Function - SPI0 1st slave select pin */

#define SYS_PE_L_MFP_PE2_MFP_GPE2         (0UL<<SYS_PE_L_MFP_PE2_MFP_Pos)     /*!<PE2 Pin Function - GPIOE[2] */
#define SYS_PE_L_MFP_PE2_MFP_SPI0_SCLK    (6UL<<SYS_PE_L_MFP_PE2_MFP_Pos)     /*!<PE2 Pin Function - SPI0 SCLK */

#define SYS_PE_L_MFP_PE1_MFP_GPE1         (0UL<<SYS_PE_L_MFP_PE1_MFP_Pos)     /*!<PE1 Pin Function - GPIOE[1] */
#define SYS_PE_L_MFP_PE1_MFP_SPI0_MISO0   (6UL<<SYS_PE_L_MFP_PE1_MFP_Pos)     /*!<PE1 Pin Function - SPI0 MISO[0] */

#define SYS_PE_L_MFP_PE0_MFP_GPE0         (0UL<<SYS_PE_L_MFP_PE0_MFP_Pos)     /*!<PE0 Pin Function - GPIOE[0] */
#define SYS_PE_L_MFP_PE0_MFP_SPI0_MOSI0   (6UL<<SYS_PE_L_MFP_PE0_MFP_Pos)     /*!<PE0 Pin Function - SPI0 MOSI[0] */

