OpenNuvoton/NuTool-PinConfigure/Header/NANO112/sys.h
/********************* Bit definition of PE_H_MFP register **********************/
#define SYS_PE_H_MFP_PE9_MFP_GPE9         (0UL<<SYS_PE_H_MFP_PE9_MFP_Pos)     /*!<PE9 Pin Function - GPIOE[9] */
#define SYS_PE_H_MFP_PE9_MFP_PWM0_CH3     (3UL<<SYS_PE_H_MFP_PE9_MFP_Pos)     /*!<PE9 Pin Function - PWM0 Channel3 output */
#define SYS_PE_H_MFP_PE9_MFP_LCD_S29      (8UL<<SYS_PE_H_MFP_PE9_MFP_Pos)     /*!<PE9 Pin Function - LCD SEG 29 */

#define SYS_PE_H_MFP_PE8_MFP_GPE8         (0UL<<SYS_PE_H_MFP_PE8_MFP_Pos)     /*!<PE8 Pin Function - GPIOA[8] */
#define SYS_PE_H_MFP_PE8_MFP_PWM0_CH2     (3UL<<SYS_PE_H_MFP_PE8_MFP_Pos)     /*!<PE8 Pin Function - PWM0 Channel3 output */
#define SYS_PE_H_MFP_PE8_MFP_LCD_S30      (8UL<<SYS_PE_H_MFP_PE8_MFP_Pos)     /*!<PE8 Pin Function - LCD SEG 30 */

/********************* Bit definition of PF_L_MFP register **********************/
#define SYS_PF_L_MFP_PF5_MFP_GPF5         (0UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - GPIOF[5] */
#define SYS_PF_L_MFP_PF5_MFP_TMR0_CAP     (2UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - Timer0 capture input */
#define SYS_PF_L_MFP_PF5_MFP_PWM0_CH3     (3UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - PWM0 Channel3 output */
#define SYS_PF_L_MFP_PF5_MFP_ACMP_C       (9UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - Comparator0 charge/discharge path */
#define SYS_PF_L_MFP_PF5_MFP_ICE_DAT      (0xFUL<<SYS_PF_L_MFP_PF5_MFP_Pos)   /*!<PF5 Pin Function - ICE DAT */

#define SYS_PF_L_MFP_PF4_MFP_GPF4         (0UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - GPIOF[4] */
#define SYS_PF_L_MFP_PF4_MFP_CKO1         (1UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - Frequency Divider1 output pin */
#define SYS_PF_L_MFP_PF4_MFP_TMR1_CAP     (2UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - Timer1 capture input  */
#define SYS_PF_L_MFP_PF4_MFP_PWM0_CH2     (3UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - PWM0 Channel2 output */
#define SYS_PF_L_MFP_PF4_MFP_CLK_Hz       (9UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - 1Hz clock output */
#define SYS_PF_L_MFP_PF4_MFP_ICE_CLK      (0xFUL<<SYS_PF_L_MFP_PF4_MFP_Pos)   /*!<PF4 Pin Function - ICE CLK */

#define SYS_PF_L_MFP_PF3_MFP_GPF3         (0UL<<SYS_PF_L_MFP_PF3_MFP_Pos)     /*!<PF3 Pin Function - GPIOF[3] */
#define SYS_PF_L_MFP_PF3_MFP_EINT0        (1UL<<SYS_PF_L_MFP_PF3_MFP_Pos)     /*!<PF3 Pin Function - External interrupt0 input pin */
#define SYS_PF_L_MFP_PF3_MFP_TMR2_CAP     (2UL<<SYS_PF_L_MFP_PF3_MFP_Pos)     /*!<PF3 Pin Function - Timer2 capture input  */
#define SYS_PF_L_MFP_PF3_MFP_UART1_TX     (7UL<<SYS_PF_L_MFP_PF3_MFP_Pos)     /*!<PF3 Pin Function - UART1 TX  */
#define SYS_PF_L_MFP_PF3_MFP_XT1_OUT      (0xFUL<<SYS_PF_L_MFP_PF3_MFP_Pos)   /*!<PF3 Pin Function - XT1 OUT */

#define SYS_PF_L_MFP_PF2_MFP_GPF2         (0UL<<SYS_PF_L_MFP_PF2_MFP_Pos)     /*!<PF2 Pin Function - GPIOF[2] */
#define SYS_PF_L_MFP_PF2_MFP_EINT1        (1UL<<SYS_PF_L_MFP_PF2_MFP_Pos)     /*!<PF2 Pin Function - External interrupt1 input pin */
#define SYS_PF_L_MFP_PF2_MFP_TMR3_CAP     (2UL<<SYS_PF_L_MFP_PF2_MFP_Pos)     /*!<PF2 Pin Function - Timer3 capture input  */
#define SYS_PF_L_MFP_PF2_MFP_UART1_RX     (7UL<<SYS_PF_L_MFP_PF2_MFP_Pos)     /*!<PF2 Pin Function - UART1 RX  */
#define SYS_PF_L_MFP_PF2_MFP_XT1_IN       (0xFUL<<SYS_PF_L_MFP_PF2_MFP_Pos)   /*!<PF2 Pin Function - XT1 IN */

#define SYS_PF_L_MFP_PF1_MFP_GPF1         (0UL<<SYS_PF_L_MFP_PF1_MFP_Pos)     /*!<PF1 Pin Function - GPIOF[1] */
#define SYS_PF_L_MFP_PF1_MFP_TMR2_CNT     (2UL<<SYS_PF_L_MFP_PF1_MFP_Pos)     /*!<PF1 Pin Function - Timer2 external counter input */
#define SYS_PF_L_MFP_PF1_MFP_X32_OUT      (0xFUL<<SYS_PF_L_MFP_PF1_MFP_Pos)   /*!<PF1 Pin Function - X32 OUT */
#define SYS_PF_L_MFP_PF1_MFP_TMR2_OUT     (0xAUL<<SYS_PF_L_MFP_PF1_MFP_Pos)   /*!<PF1 Pin Function - Timer2 toggle out */

#define SYS_PF_L_MFP_PF0_MFP_GPF0         (0UL<<SYS_PF_L_MFP_PF0_MFP_Pos)     /*!<PF0 Pin Function - GPIOF[0] */
#define SYS_PF_L_MFP_PF0_MFP_TMR3_CNT     (2UL<<SYS_PF_L_MFP_PF0_MFP_Pos)     /*!<PF0 Pin Function - Timer3 external counter input */
#define SYS_PF_L_MFP_PF0_MFP_X32_IN       (0xFUL<<SYS_PF_L_MFP_PF0_MFP_Pos)   /*!<PF0 Pin Function - X32 IN */
#define SYS_PF_L_MFP_PF0_MFP_TMR3_OUT     (0xAUL<<SYS_PF_L_MFP_PF0_MFP_Pos)   /*!<PF0 Pin Function - Timer3 toggle out */

/*!<Enable LCD for 100 Pin Package */
#define MFP_LCD_TYPEA() { \
                            SYS->PB_L_MFP = (SYS->PB_L_MFP &~(0xFFF00000)) | (0x88800000);  /* seg 35 ~ 33 */\
                            SYS->PB_H_MFP = 0x88888888;   /* seg 32 ~ 31, 28 ~ 23 */\
                            SYS->PC_L_MFP = 0x88888888;   /* seg 22 ~ 15 */\
                            SYS->PC_H_MFP = 0x88888888;   /* seg 14 ~ 7 */\
                            SYS->PD_L_MFP = 0x88888888;   /* seg 6 ~ 0, COM3 */\
                            SYS->PD_H_MFP = 0x88888888;   /* COM2 ~ 0, DH2 ~ 1, V3 ~1 */\
                            SYS->PE_H_MFP = (SYS->PE_H_MFP &~(0x000000FF)) | (0x00000088);   /* seg 30, 29 */\
                            PB->OFFD |= 0xFFE00000;\
                            PC->OFFD |= 0xFFFF0000;\
                            PD->OFFD |= 0xFFFF0000;\
                            PE->OFFD |= 0x03000000;\
                        }

/*@}*/ /* end of group NANO1X2_SYS_EXPORTED_CONSTANTS */

/** @addtogroup NANO1X2_SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/
/**
  * @brief      Clear Brown-out detector interrupt flag
  * @param      None
  * @return     None
  * @details    This macro clear Brown-out detector interrupt flag.
  */
#define SYS_CLEAR_BOD_INT_FLAG()        (SYS->BODSTS |= SYS_BODSTS_BOD_INT_Msk)

/**
  * @brief      Disable Brown-out 2.5V detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out 2.5V detector function.
  */
#define SYS_DISABLE_BOD25()             (SYS->BODCTL &= ~SYS_BODCTL_BOD25_EN_Msk)

/**
  * @brief      Enable Brown-out 2.5V detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out 2.5V detector function.
  */
#define SYS_ENABLE_BOD25()              (SYS->BODCTL |= SYS_BODCTL_BOD25_EN_Msk)

/**
  * @brief      Disable Brown-out 2.0V detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out 2.0V detector function.
  */
#define SYS_DISABLE_BOD20()             (SYS->BODCTL &= ~SYS_BODCTL_BOD20_EN_Msk)

/**
  * @brief      Enable Brown-out 2.0V detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out 2.0V detector function.
  */
#define SYS_ENABLE_BOD20()              (SYS->BODCTL |= SYS_BODCTL_BOD20_EN_Msk)

/**
  * @brief      Disable Brown-out 1.7V detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out 1.7V detector function.
  */
#define SYS_DISABLE_BOD17()             (SYS->BODCTL &= ~SYS_BODCTL_BOD17_EN_Msk)

/**
  * @brief      Enable Brown-out 1.7V detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out 1.7V detector function.
  */
#define SYS_ENABLE_BOD17()              (SYS->BODCTL |= SYS_BODCTL_BOD17_EN_Msk)

/**
  * @brief      Get Brown-out detector interrupt flag
  * @param      None
  * @retval     0   Brown-out detect interrupt flag is not set.
  * @retval     >=1 Brown-out detect interrupt flag is set.
  * @details    This macro get Brown-out detector interrupt flag.
  */
#define SYS_GET_BOD_INT_FLAG()          (SYS->BODSTS & SYS_BODSTS_BOD_INT_Msk)

/**
  * @brief      Get Brown-out 2.5V detector status
  * @param      None
  * @retval     0   System voltage is higher than 2.5V setting or BOD_EN is 0.
  * @retval     >=1 System voltage is lower than 2.5V setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD_EN is 0, this function always return 0.
  */
#define SYS_GET_BOD25_OUTPUT()          (SYS->BODSTS & SYS_BODSTS_BOD25_drop_Msk)

/**
  * @brief      Get Brown-out 2.0V detector status
  * @param      None
  * @retval     0   System voltage is higher than 2.0V setting or BOD_EN is 0.
  * @retval     >=1 System voltage is lower than 2.0V setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD_EN is 0, this function always return 0.
  */
#define SYS_GET_BOD20_OUTPUT()          (SYS->BODSTS & SYS_BODSTS_BOD20_drop_Msk)

/**
  * @brief      Get Brown-out 1.7V detector status
  * @param      None
  * @retval     0   System voltage is higher than 1.7V setting or BOD_EN is 0.
  * @retval     >=1 System voltage is lower than 1.7V setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD_EN is 0, this function always return 0.
  */
#define SYS_GET_BOD17_OUTPUT()          (SYS->BODSTS & SYS_BODSTS_BOD17_drop_Msk)

/**
  * @brief      Disable Brown-out 2.5V detector interrupt function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector interrupt function.
  */
#define SYS_DISABLE_BOD25_RST()         (SYS->BODCTL &= ~SYS_BODCTL_BOD25_RST_EN_Msk)

/**
  * @brief      Enable Brown-out 2.5V detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  */
#define SYS_ENABLE_BOD25_RST()          (SYS->BODCTL |= SYS_BODCTL_BOD25_RST_EN_Msk)

/**
  * @brief      Disable Brown-out 2.0V detector interrupt function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector interrupt function.
  */
#define SYS_DISABLE_BOD20_RST()         (SYS->BODCTL &= ~SYS_BODCTL_BOD20_RST_EN_Msk)

/**
  * @brief      Enable Brown-out 2.0V detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  */
#define SYS_ENABLE_BOD20_RST()          (SYS->BODCTL |= SYS_BODCTL_BOD20_RST_EN_Msk)

/**
  * @brief      Disable Brown-out 1.7V detector interrupt function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector interrupt function.
  */
#define SYS_DISABLE_BOD17_RST()         (SYS->BODCTL &= ~SYS_BODCTL_BOD17_RST_EN_Msk)

/**
  * @brief      Enable Brown-out 1.7V detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  */
#define SYS_ENABLE_BOD17_RST()          (SYS->BODCTL |= SYS_BODCTL_BOD17_RST_EN_Msk)

/**
  * @brief      Get reset source is from Brown-out detector reset
  * @param      None
  * @retval     0   Previous reset source is not from Brown-out detector reset
  * @retval     >=1 Previous reset source is from Brown-out detector reset
  * @details    This macro get previous reset source is from Brown-out detect reset or not.
  */
#define SYS_IS_BOD_RST()                (SYS->RST_SRC & SYS_RST_SRC_RSTS_BOD_Msk)


/**
  * @brief      Get reset source is from CPU reset
  * @param      None
  * @retval     0   Previous reset source is not from CPU reset
  * @retval     >=1 Previous reset source is from CPU reset
  * @details    This macro get previous reset source is from CPU reset.
  */
#define SYS_IS_CPU_RST()                (SYS->RST_SRC & SYS_RST_SRC_RSTS_CPU_Msk)

/**
  * @brief      Get reset source is from Power-on Reset
  * @param      None
  * @retval     0   Previous reset source is not from Power-on Reset
  * @retval     >=1 Previous reset source is from Power-on Reset
  * @details    This macro get previous reset source is from Power-on Reset.
  */
#define SYS_IS_POR_RST()                (SYS->RST_SRC & SYS_RST_SRC_RSTS_POR_Msk)

/**
  * @brief      Get reset source is from reset pin reset
  * @param      None
  * @retval     0   Previous reset source is not from reset pin reset
  * @retval     >=1 Previous reset source is from reset pin reset
  * @details    This macro get previous reset source is from reset pin reset.
  */
#define SYS_IS_RSTPIN_RST()             (SYS->RST_SRC & SYS_RST_SRC_RSTS_PAD_Msk)

/**
  * @brief      Get reset source is from system reset
  * @param      None
  * @retval     0   Previous reset source is not from system reset
  * @retval     >=1 Previous reset source is from system reset
  * @details    This macro get previous reset source is from system reset.
  */
#define SYS_IS_SYSTEM_RST()             (SYS->RST_SRC & SYS_RST_SRC_RSTS_SYS_Msk)


/**
  * @brief      Get reset source is from window watch dog reset
  * @param      None
  * @retval     0   Previous reset source is not from window watch dog reset
  * @retval     >=1 Previous reset source is from window watch dog reset
  * @details    This macro get previous reset source is from window watch dog reset.
  */
#define SYS_IS_WDT_RST()                (SYS->RST_SRC & SYS_RST_SRC_RSTS_WDT_Msk)

/**
  * @brief      Disable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Power-on Reset function.
  */
#define SYS_DISABLE_POR()               (SYS->PORCTL = 0x5AA5)

/**
  * @brief      Enable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Power-on Reset function.
  */
#define SYS_ENABLE_POR()                (SYS->PORCTL = 0)


/**
  * @brief      Clear reset source flag
  * @param[in]  u32RstSrc is reset source. Including:
  *             - \ref SYS_RST_SRC_RSTS_POR_Msk
  *             - \ref SYS_RST_SRC_RSTS_PAD_Msk
  *             - \ref SYS_RST_SRC_RSTS_WDT_Msk
  *             - \ref SYS_RST_SRC_RSTS_BOD_Msk
  *             - \ref SYS_RST_SRC_RSTS_SYS_Msk
  *             - \ref SYS_RST_SRC_RSTS_CPU_Msk
  * @return     None
  * @details    This macro clear reset source flag.
  */
#define SYS_CLEAR_RST_SOURCE(u32RstSrc) (SYS->RST_SRC |= u32RstSrc )

/**
  * @brief      Disable register write-protection function
  * @param      None
  * @return     None
  * @details    This function disable register write-protection function.
  *             To unlock the protected register to allow write access.
  */
__STATIC_INLINE void SYS_UnlockReg(void)
{
    while(SYS->RegLockAddr != SYS_RegLockAddr_RegUnLock_Msk) {
        SYS->RegLockAddr = 0x59;
        SYS->RegLockAddr = 0x16;
        SYS->RegLockAddr = 0x88;
    }
}

/**
  * @brief      Enable register write-protection function
  * @param      None
  * @return     None
  * @details    This function is used to enable register write-protection function.
  *             To lock the protected register to forbid write access.
  */
__STATIC_INLINE void SYS_LockReg(void)
{
    SYS->RegLockAddr = 0;
}

/**
  * @brief      Get HIRC trim status
  * @param      None
  * @retval     BIT0 HIRC Frequency Lock
  * @retval     BIT1 Trim Failure Interrupt
  * @retval     BIT2 LXT Clock error
  * @details    This macro get HIRC trim interrupt status register.
  */
#define SYS_GET_IRCTRIM_INT_FLAG()          (SYS->IRCTRIMINT)

/**
  * @brief      Clear HIRC trim flag
  * @param[in]  u32IRCTrimFlg is HIRC trim flags. Including:
  *             - \ref SYS_IRCTRIMINT_FAIL_INT
  *             - \ref SYS_IRCTRIMINT_32KERR_INT
  * @return     None
  * @details    This macro clear HIRC trim flag.
  */
#define SYS_CLEAR_IRCTRIM_INT_FLAG(u32IRCTrimFlg)          (SYS->IRCTRIMINT = u32IRCTrimFlg )

void SYS_ClearResetSrc(uint32_t u32Src);
uint32_t SYS_GetBODStatus(void);
uint32_t SYS_GetResetSrc(void);
uint32_t SYS_IsRegLocked(void);
void SYS_LockReg(void);
void SYS_UnlockReg(void);
uint32_t  SYS_ReadPDID(void);
void SYS_ResetChip(void);
void SYS_ResetCPU(void);
void SYS_ResetModule(uint32_t u32ModuleIndex);
void SYS_EnableBOD(int32_t i32Mode, uint32_t u32BODLevel);
void SYS_DisableBOD(void);
void SYS_EnableIRCTrim(uint32_t u32TrimSel,uint32_t u32TrimEnInt);
void SYS_DisableIRCTrim(void);
/*@}*/ /* end of group NANO1X2_SYS_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO1X2_SYS_Driver */

/*@}*/ /* end of group NANO1X2_Device_Driver */

#ifdef __cplusplus
}
#endif

#endif //__SYS_H__

/*** (C) COPYRIGHT 2014 Nuvoton Technology Corp. ***/